tap "golangci/tap"
tap "hashicorp/tap"
tap "puma/puma"

brew "autoconf"
brew "automake"
brew "openssl@3"
brew "readline"
brew "awscli"
brew "bash"
brew "coreutils"
brew "fd"
brew "gh"
brew "git"
brew "gnupg"
brew "jq"
brew "k9s"
brew "kubernetes-cli"
brew "kubectx"
brew "libpq"
brew "libtool"
brew "libyaml"
brew "minikube"
brew "mise"
brew "neovim"
brew "netcat"
brew "openssl@1.1"
brew "pkgconf"
brew "postgresql@14"
brew "protobuf"
brew "rbenv"
brew "ripgrep"
brew "shared-mime-info"
brew "tmux"
brew "wget"
brew "zlib"
brew "golangci/tap/golangci-lint"
brew "hashicorp/tap/vault"
brew "puma/puma/puma-dev"

cask "docker-desktop"
cask "font-inconsolata-go-nerd-font"
cask "ghostty"

vscode "golang.go"
vscode "hashicorp.terraform"
vscode "ms-vscode.makefile-tools"

go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
